# CustomFieldData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CustomFieldData Class
Members See Also
---
A class that offer access to the information about a custom field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class CustomFieldData : IDisposable
```

Visual Basic
---
```text
Public Class CustomFieldData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class CustomFieldData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..CustomFieldData
# See Also
CustomFieldData Members
Autodesk.Revit.DB Namespace